#include "defs.h"                                                               //подключаем файл с определениями

//обычная реализация атомарных функций и спектров

long double up(long double x, dword s, word m);   // атомарная функция up(x)
long double fup(long double u, word m); //спектр up(x)
long double upn(long double x, dword n, dword s, word m);  // атомарная функция fup(x)
long double fupn(long double u, dword n, word m); //спектр fup(x)

//реализация объекта с upn и таблицей

class atomfunc                                           	//описание класса простых сомножителей.
 {
  private:
    dword n;                          				      	//длина
    dword ns;
    dword np;
    dword nc;
    long double *fupna;                                           	//Здесь - массив.

  public:
    atomfunc(const dword n1, word np1);									//конструктор по заданным параметрам.
    ~atomfunc() { delete [] fupna; }							//деструктор


    long double upn(long double x, dword n);  // атомарная функция fup(x)
    long double fupn(long double u, dword n); //спектр fup(x)
    
    dword getn() { return n; }				//возвращает число
  };


/*const long double up_table[] = {0.354008603e-10, 0.167693347e-7,  0.420576116e-6,  0.347816874e-5,  0.161841326e-4,
                            0.532555251e-4,  0.139055523e-3,  0.308138660e-3,  0.605106267e-3,  0.108343562e-2,
                            0.180999032e-2,  0.282644445e-2,  0.421800000e-2,  0.604155412e-2,  0.836100883e-2,
                            0.112393379e-1,  0.147363055e-1,  0.189053889e-1,  0.237911889e-1,  0.294282603e-1,
                            0.358409663e-1,  0.430440239e-1,  0.510444877e-1,  0.598444445e-1,  0.694444445e-1,
                            0.798444445e-1,  0.910444278e-1,  0.103044024,     0.115840866,     0.129427260,
                            0.143991189,     0.158905389,     0.174736305,     0.191239338,     0.208361009,
                            0.226041554,     0.244218000,     0.262826445,     0.281802850,     0.301083436,
                            0.320605107,     0.340308139,     0.360139056,     0.380053256,     0.400016184,
                            0.420003478,     0.440000421,     0.460000017,     0.480000000,     0.500000000    };*/
/*long double ma_up(dword n); // симметричные моменты атомарная функция up(x)
long double mb_up(dword n); // несимметричные моменты атомарная функция up(x)
dword factorial(dword n);*/
